#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.foo: Refreshing state... [id=foo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ssm_parameter.foo is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "foo" {
      ~ arn            = "arn:aws:ssm:us-east-2:724273188560:parameter/foo" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      + has_value_wo   = (known after apply)
      ~ id             = "foo" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
        name           = "foo"
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ErickNo1, Action: `pull_request`*